{
    "userid": {
        "__PAD__": 0,
        "227368": 1,
        "874257": 2,
        "911194": 3,
        "514836": 4,
        "693616": 5,
        "479339": 6,
        "268502": 7,
        "353405": 8,
        "370363": 9,
        "477708": 10,
        "524548": 11,
        "549940": 12,
        "55033": 13,
        "608569": 14,
        "616268": 15,
        "664542": 16,
        "754948": 17,
        "832981": 18,
        "871665": 19,
        "992364": 20,
        "1115242": 21,
        "391781": 22,
        "626053": 23,
        "949173": 24,
        "__OOV__": 25
    },
    "adgroup_id": {
        "__PAD__": 0,
        "170301": 1,
        "756739": 2,
        "573514": 3,
        "680144": 4,
        "117738": 5,
        "118678": 6,
        "148505": 7,
        "158525": 8,
        "164095": 9,
        "168937": 10,
        "169140": 11,
        "172298": 12,
        "192645": 13,
        "194654": 14,
        "214782": 15,
        "223448": 16,
        "225892": 17,
        "261620": 18,
        "263526": 19,
        "27032": 20,
        "318447": 21,
        "320222": 22,
        "323703": 23,
        "339931": 24,
        "361919": 25,
        "362454": 26,
        "366559": 27,
        "383937": 28,
        "395732": 29,
        "415119": 30,
        "41803": 31,
        "431258": 32,
        "444691": 33,
        "452391": 34,
        "454239": 35,
        "467092": 36,
        "472153": 37,
        "473741": 38,
        "477950": 39,
        "506323": 40,
        "512277": 41,
        "513129": 42,
        "519384": 43,
        "530249": 44,
        "530563": 45,
        "537137": 46,
        "540137": 47,
        "541502": 48,
        "545057": 49,
        "54756": 50,
        "553889": 51,
        "561543": 52,
        "570475": 53,
        "570906": 54,
        "571696": 55,
        "572396": 56,
        "576624": 57,
        "588074": 58,
        "594936": 59,
        "595104": 60,
        "596489": 61,
        "601638": 62,
        "604453": 63,
        "605570": 64,
        "620312": 65,
        "627549": 66,
        "633154": 67,
        "636019": 68,
        "636508": 69,
        "646876": 70,
        "651184": 71,
        "654663": 72,
        "659142": 73,
        "662621": 74,
        "663034": 75,
        "674268": 76,
        "675017": 77,
        "677904": 78,
        "679190": 79,
        "681978": 80,
        "687140": 81,
        "690119": 82,
        "696459": 83,
        "698324": 84,
        "702219": 85,
        "703594": 86,
        "713414": 87,
        "722867": 88,
        "726574": 89,
        "734869": 90,
        "742211": 91,
        "758902": 92,
        "789390": 93,
        "87979": 94,
        "__OOV__": 95
    },
    "pid": {
        "__PAD__": 0,
        "430548_1007": 1,
        "430539_1007": 2,
        "__OOV__": 3
    },
    "cate_id": {
        "__PAD__": 0,
        "6261": 1,
        "4505": 2,
        "4281": 3,
        "4385": 4,
        "1665": 5,
        "4292": 6,
        "4520": 7,
        "5443": 8,
        "5851": 9,
        "6407": 10,
        "824": 11,
        "1535": 12,
        "4267": 13,
        "4283": 14,
        "4609": 15,
        "6255": 16,
        "6286": 17,
        "7212": 18,
        "8112": 19,
        "10876": 20,
        "1226": 21,
        "2201": 22,
        "333": 23,
        "4278": 24,
        "4280": 25,
        "4282": 26,
        "4284": 27,
        "4288": 28,
        "4532": 29,
        "5263": 30,
        "5316": 31,
        "5487": 32,
        "6140": 33,
        "6158": 34,
        "6183": 35,
        "6251": 36,
        "6416": 37,
        "6426": 38,
        "6432": 39,
        "6433": 40,
        "6733": 41,
        "6760": 42,
        "7184": 43,
        "7339": 44,
        "8202": 45,
        "9460": 46,
        "9784": 47,
        "__OOV__": 48
    },
    "campaign_id": {
        "__PAD__": 0,
        "137739": 1,
        "142840": 2,
        "225404": 3,
        "101437": 4,
        "102833": 5,
        "107755": 6,
        "112846": 7,
        "113420": 8,
        "115316": 9,
        "119792": 10,
        "122722": 11,
        "133152": 12,
        "133243": 13,
        "138066": 14,
        "138651": 15,
        "143482": 16,
        "144634": 17,
        "14905": 18,
        "150068": 19,
        "153671": 20,
        "155404": 21,
        "155775": 22,
        "156256": 23,
        "158024": 24,
        "160194": 25,
        "166931": 26,
        "17377": 27,
        "175802": 28,
        "181057": 29,
        "183759": 30,
        "184743": 31,
        "187111": 32,
        "188896": 33,
        "192463": 34,
        "200410": 35,
        "202498": 36,
        "223853": 37,
        "225230": 38,
        "230502": 39,
        "234927": 40,
        "237347": 41,
        "237467": 42,
        "239633": 43,
        "241951": 44,
        "244703": 45,
        "246731": 46,
        "252478": 47,
        "254792": 48,
        "256512": 49,
        "259290": 50,
        "264355": 51,
        "265350": 52,
        "274193": 53,
        "286110": 54,
        "292338": 55,
        "302529": 56,
        "330322": 57,
        "345337": 58,
        "345717": 59,
        "346951": 60,
        "347880": 61,
        "348684": 62,
        "349173": 63,
        "35662": 64,
        "360936": 65,
        "363218": 66,
        "364151": 67,
        "366810": 68,
        "369584": 69,
        "381129": 70,
        "384547": 71,
        "385451": 72,
        "386201": 73,
        "38772": 74,
        "393232": 75,
        "394213": 76,
        "397994": 77,
        "398109": 78,
        "398575": 79,
        "399132": 80,
        "408795": 81,
        "419685": 82,
        "419872": 83,
        "421861": 84,
        "44486": 85,
        "57459": 86,
        "59075": 87,
        "6710": 88,
        "67660": 89,
        "76341": 90,
        "76510": 91,
        "84597": 92,
        "8530": 93,
        "87006": 94,
        "93454": 95,
        "94871": 96,
        "95200": 97,
        "__OOV__": 98
    },
    "customer": {
        "__PAD__": 0,
        "1210": 1,
        "179648": 2,
        "215611": 3,
        "79797": 4,
        "103078": 5,
        "109572": 6,
        "117313": 7,
        "11968": 8,
        "119724": 9,
        "120884": 10,
        "124874": 11,
        "13072": 12,
        "131908": 13,
        "132719": 14,
        "135248": 15,
        "13787": 16,
        "144223": 17,
        "14471": 18,
        "149747": 19,
        "151804": 20,
        "155582": 21,
        "155607": 22,
        "156608": 23,
        "157846": 24,
        "162663": 25,
        "164284": 26,
        "171746": 27,
        "171879": 28,
        "172777": 29,
        "173817": 30,
        "179212": 31,
        "1823": 32,
        "182659": 33,
        "183715": 34,
        "184541": 35,
        "185150": 36,
        "186875": 37,
        "189572": 38,
        "19216": 39,
        "195682": 40,
        "205433": 41,
        "20604": 42,
        "214436": 43,
        "21689": 44,
        "217182": 45,
        "222509": 46,
        "223269": 47,
        "224983": 48,
        "228674": 49,
        "22878": 50,
        "232575": 51,
        "238466": 52,
        "239574": 53,
        "24984": 54,
        "252276": 55,
        "25471": 56,
        "254969": 57,
        "25728": 58,
        "25760": 59,
        "27731": 60,
        "28339": 61,
        "3024": 62,
        "32537": 63,
        "33287": 64,
        "343": 65,
        "35990": 66,
        "36888": 67,
        "37031": 68,
        "42812": 69,
        "43184": 70,
        "47076": 71,
        "49079": 72,
        "51721": 73,
        "52598": 74,
        "53778": 75,
        "5406": 76,
        "55297": 77,
        "55729": 78,
        "56774": 79,
        "573": 80,
        "57362": 81,
        "5902": 82,
        "63559": 83,
        "68631": 84,
        "73832": 85,
        "75534": 86,
        "75881": 87,
        "77114": 88,
        "7844": 89,
        "80092": 90,
        "82710": 91,
        "83172": 92,
        "864": 93,
        "88742": 94,
        "94205": 95,
        "96798": 96,
        "__OOV__": 97
    },
    "brand": {
        "__PAD__": 0,
        "144123": 1,
        "158849": 2,
        "197848": 3,
        "293023": 4,
        "337365": 5,
        "59477": 6,
        "87032": 7,
        "90316": 8,
        "106641": 9,
        "106924": 10,
        "11022": 11,
        "137274": 12,
        "139647": 13,
        "141341": 14,
        "156936": 15,
        "160253": 16,
        "166416": 17,
        "166878": 18,
        "180856": 19,
        "186516": 20,
        "194203": 21,
        "194532": 22,
        "206353": 23,
        "215442": 24,
        "220468": 25,
        "234028": 26,
        "247789": 27,
        "255820": 28,
        "259883": 29,
        "270537": 30,
        "290511": 31,
        "291723": 32,
        "302582": 33,
        "304332": 34,
        "30520": 35,
        "3130": 36,
        "314219": 37,
        "314496": 38,
        "317982": 39,
        "321464": 40,
        "327032": 41,
        "339907": 42,
        "364212": 43,
        "388290": 44,
        "389298": 45,
        "395808": 46,
        "40827": 47,
        "409777": 48,
        "418677": 49,
        "41873": 50,
        "420137": 51,
        "424150": 52,
        "42518": 53,
        "425293": 54,
        "42695": 55,
        "455009": 56,
        "53923": 57,
        "54471": 58,
        "58727": 59,
        "65658": 60,
        "73218": 61,
        "80633": 62,
        "89842": 63,
        "95340": 64,
        "98630": 65,
        "__OOV__": 66
    },
    "cms_segid": {
        "__PAD__": 0,
        "0": 1,
        "20": 2,
        "33": 3,
        "44": 4,
        "16": 5,
        "36": 6,
        "57": 7,
        "77": 8,
        "8": 9,
        "__OOV__": 10
    },
    "cms_group_id": {
        "__PAD__": 0,
        "3": 1,
        "4": 2,
        "1": 3,
        "5": 4,
        "7": 5,
        "9": 6,
        "2": 7,
        "10": 8,
        "8": 9,
        "__OOV__": 10
    },
    "final_gender_code": {
        "__PAD__": 0,
        "2": 1,
        "1": 2,
        "__OOV__": 3
    },
    "age_level": {
        "__PAD__": 0,
        "3": 1,
        "4": 2,
        "1": 3,
        "5": 4,
        "2": 5,
        "__OOV__": 6
    },
    "pvalue_level": {
        "__PAD__": 0,
        "2": 1,
        "1": 2,
        "__OOV__": 3
    },
    "shopping_level": {
        "__PAD__": 0,
        "3": 1,
        "1": 2,
        "2": 3,
        "__OOV__": 4
    },
    "occupation": {
        "__PAD__": 0,
        "0": 1,
        "1": 2,
        "__OOV__": 3
    }
}