{
    "I1": {
        "__PAD__": 0,
        "0.0": 1,
        "0.05": 2,
        "0.1": 3,
        "0.15": 4,
        "0.2": 5,
        "0.25": 6,
        "1.0": 7,
        "0.3": 8,
        "0.35": 9,
        "0.4": 10,
        "0.45": 11,
        "0.5": 12,
        "0.55": 13,
        "0.65": 14,
        "0.6": 15,
        "0.75": 16,
        "0.8": 17,
        "0.7": 18,
        "0.85": 19,
        "0.9": 20,
        "0.95": 21,
        "__OOV__": 22
    },
    "I2": {
        "__PAD__": 0,
        "0.004975": 1,
        "0.006633": 2,
        "0.003317": 3,
        "0.008292": 4,
        "1.0": 5,
        "0.00995": 6,
        "0.011609": 7,
        "0.013267": 8,
        "0.014925": 9,
        "0.016584": 10,
        "0.018242": 11,
        "0.0199": 12,
        "0.021559": 13,
        "0.023217": 14,
        "0.031509": 15,
        "0.026534": 16,
        "0.024876": 17,
        "0.028192": 18,
        "0.033167": 19,
        "0.029851": 20,
        "0.039801": 21,
        "0.034826": 22,
        "0.038143": 23,
        "0.041459": 24,
        "0.044776": 25,
        "0.043118": 26,
        "0.046434": 27,
        "0.036484": 28,
        "0.05141": 29,
        "0.049751": 30,
        "0.054726": 31,
        "0.056385": 32,
        "0.063018": 33,
        "0.303483": 34,
        "0.074627": 35,
        "0.048093": 36,
        "0.058043": 37,
        "0.079602": 38,
        "0.053068": 39,
        "0.069652": 40,
        "0.06136": 41,
        "0.066335": 42,
        "0.067993": 43,
        "0.059701": 44,
        "0.064677": 45,
        "0.077944": 46,
        "0.08126": 47,
        "0.076285": 48,
        "0.072968": 49,
        "0.305141": 50,
        "0.091211": 51,
        "0.07131": 52,
        "0.082919": 53,
        "0.084577": 54,
        "0.104478": 55,
        "0.099502": 56,
        "0.107794": 57,
        "0.102819": 58,
        "0.089552": 59,
        "0.096186": 60,
        "0.086235": 61,
        "0.101161": 62,
        "0.106136": 63,
        "0.097844": 64,
        "0.087894": 65,
        "0.094527": 66,
        "0.112769": 67,
        "0.092869": 68,
        "0.114428": 69,
        "0.116086": 70,
        "0.14262": 71,
        "0.154229": 72,
        "0.109453": 73,
        "0.306799": 74,
        "0.111111": 75,
        "0.129353": 76,
        "0.137645": 77,
        "0.175788": 78,
        "0.119403": 79,
        "0.12272": 80,
        "0.147595": 81,
        "0.15257": 82,
        "0.157546": 83,
        "0.301824": 84,
        "0.124378": 85,
        "0.144279": 86,
        "0.160862": 87,
        "0.19403": 88,
        "0.131012": 89,
        "0.139303": 90,
        "0.170813": 91,
        "0.117745": 92,
        "0.121061": 93,
        "0.149254": 94,
        "0.150912": 95,
        "0.174129": 96,
        "0.135987": 97,
        "0.145937": 98,
        "0.159204": 99,
        "0.001658": 100,
        "0.134328": 101,
        "0.155887": 102,
        "0.172471": 103,
        "0.210614": 104,
        "0.220564": 105,
        "0.13267": 106,
        "0.180763": 107,
        "0.126036": 108,
        "0.162521": 109,
        "0.164179": 110,
        "0.165837": 111,
        "0.179104": 112,
        "0.182421": 113,
        "0.18408": 114,
        "0.187396": 115,
        "0.20398": 116,
        "0.222222": 117,
        "0.185738": 118,
        "0.208955": 119,
        "0.217247": 120,
        "0.228856": 121,
        "0.288557": 122,
        "0.140962": 123,
        "0.189055": 124,
        "0.230514": 125,
        "0.240464": 126,
        "0.243781": 127,
        "0.268657": 128,
        "0.504146": 129,
        "0.127695": 130,
        "0.169154": 131,
        "0.190713": 132,
        "0.192371": 133,
        "0.202322": 134,
        "0.205638": 135,
        "0.207297": 136,
        "0.215589": 137,
        "0.223881": 138,
        "0.252073": 139,
        "0.25539": 140,
        "0.260365": 141,
        "0.281924": 142,
        "0.290216": 143,
        "0.293532": 144,
        "0.311774": 145,
        "0.323383": 146,
        "0.334992": 147,
        "0.33665": 148,
        "0.500829": 149,
        "0.177446": 150,
        "0.21393": 151,
        "0.225539": 152,
        "0.227197": 153,
        "0.237148": 154,
        "0.238806": 155,
        "0.257048": 156,
        "0.270315": 157,
        "0.278607": 158,
        "0.298507": 159,
        "0.300166": 160,
        "0.330017": 161,
        "0.386401": 162,
        "0.401327": 163,
        "0.509121": 164,
        "0.167496": 165,
        "0.195688": 166,
        "0.218905": 167,
        "0.245439": 168,
        "0.263682": 169,
        "0.26534": 170,
        "0.310116": 171,
        "0.331675": 172,
        "0.344942": 173,
        "0.412935": 174,
        "0.441128": 175,
        "0.497512": 176,
        "0.651741": 177,
        "0.200663": 178,
        "0.212272": 179,
        "0.242123": 180,
        "0.253731": 181,
        "0.27529": 182,
        "0.283582": 183,
        "0.28524": 184,
        "0.286899": 185,
        "0.291874": 186,
        "0.313433": 187,
        "0.318408": 188,
        "0.343284": 189,
        "0.374793": 190,
        "0.384743": 191,
        "0.389718": 192,
        "0.396352": 193,
        "0.434494": 194,
        "0.439469": 195,
        "0.502488": 196,
        "0.507463": 197,
        "0.529022": 198,
        "0.819237": 199,
        "0.197347": 200,
        "0.232172": 201,
        "0.233831": 202,
        "0.235489": 203,
        "0.248756": 204,
        "0.262023": 205,
        "0.271973": 206,
        "0.273632": 207,
        "0.276949": 208,
        "0.295191": 209,
        "0.296849": 210,
        "0.308458": 211,
        "0.315091": 212,
        "0.31675": 213,
        "0.320066": 214,
        "0.325041": 215,
        "0.3267": 216,
        "0.341625": 217,
        "0.349917": 218,
        "0.363184": 219,
        "0.364842": 220,
        "0.371476": 221,
        "0.373134": 222,
        "0.402985": 223,
        "0.446103": 224,
        "0.466003": 225,
        "0.495854": 226,
        "0.505804": 227,
        "0.512438": 228,
        "0.515755": 229,
        "0.522388": 230,
        "0.542289": 231,
        "0.547264": 232,
        "0.563847": 233,
        "0.631841": 234,
        "0.678275": 235,
        "0.199005": 236,
        "0.247098": 237,
        "0.266998": 238,
        "0.351575": 239,
        "0.356551": 240,
        "0.358209": 241,
        "0.361526": 242,
        "0.38806": 243,
        "0.409619": 244,
        "0.421227": 245,
        "0.422886": 246,
        "0.431177": 247,
        "0.432836": 248,
        "0.437811": 249,
        "0.442786": 250,
        "0.444444": 251,
        "0.451078": 252,
        "0.452736": 253,
        "0.470978": 254,
        "0.499171": 255,
        "0.527363": 256,
        "0.53068": 257,
        "0.552239": 258,
        "0.577114": 259,
        "0.603648": 260,
        "0.628524": 261,
        "0.658375": 262,
        "0.671642": 263,
        "0.681592": 264,
        "0.742952": 265,
        "0.766169": 266,
        "0.777778": 267,
        "0.784411": 268,
        "0.852405": 269,
        "0.925373": 270,
        "0.966833": 271,
        "0.9801": 272,
        "0.981758": 273,
        "0.998342": 274,
        "0.250415": 275,
        "0.280265": 276,
        "0.338308": 277,
        "0.3466": 278,
        "0.366501": 279,
        "0.369818": 280,
        "0.376451": 281,
        "0.379768": 282,
        "0.381426": 283,
        "0.391376": 284,
        "0.393035": 285,
        "0.394693": 286,
        "0.39801": 287,
        "0.404643": 288,
        "0.406302": 289,
        "0.40796": 290,
        "0.426202": 291,
        "0.44942": 292,
        "0.457711": 293,
        "0.472637": 294,
        "0.477612": 295,
        "0.485904": 296,
        "0.489221": 297,
        "0.517413": 298,
        "0.533997": 299,
        "0.545605": 300,
        "0.553897": 301,
        "0.557214": 302,
        "0.558872": 303,
        "0.567164": 304,
        "0.570481": 305,
        "0.585406": 306,
        "0.590381": 307,
        "0.59204": 308,
        "0.598673": 309,
        "0.60199": 310,
        "0.636816": 311,
        "0.638474": 312,
        "0.640133": 313,
        "0.650083": 314,
        "0.6534": 315,
        "0.668325": 316,
        "0.674959": 317,
        "0.688226": 318,
        "0.716418": 319,
        "0.72471": 320,
        "0.733002": 321,
        "0.737977": 322,
        "0.769486": 323,
        "0.776119": 324,
        "0.78607": 325,
        "0.817579": 326,
        "0.85738": 327,
        "0.890547": 328,
        "0.91874": 329,
        "0.951907": 330,
        "0.961857": 331,
        "0.991708": 332,
        "0.328358": 333,
        "0.348259": 334,
        "0.354892": 335,
        "0.368159": 336,
        "0.378109": 337,
        "0.399668": 338,
        "0.411277": 339,
        "0.414594": 340,
        "0.436153": 341,
        "0.447761": 342,
        "0.454395": 343,
        "0.462687": 344,
        "0.464345": 345,
        "0.46932": 346,
        "0.474295": 347,
        "0.47927": 348,
        "0.482587": 349,
        "0.484245": 350,
        "0.490879": 351,
        "0.494196": 352,
        "0.519071": 353,
        "0.524046": 354,
        "0.532338": 355,
        "0.548922": 356,
        "0.555556": 357,
        "0.562189": 358,
        "0.575456": 359,
        "0.580431": 360,
        "0.597015": 361,
        "0.600332": 362,
        "0.605307": 363,
        "0.606965": 364,
        "0.613599": 365,
        "0.616915": 366,
        "0.645108": 367,
        "0.655058": 368,
        "0.66335": 369,
        "0.6733": 370,
        "0.676617": 371,
        "0.696517": 372,
        "0.698176": 373,
        "0.711443": 374,
        "0.719735": 375,
        "0.721393": 376,
        "0.723051": 377,
        "0.739635": 378,
        "0.747927": 379,
        "0.756219": 380,
        "0.759536": 381,
        "0.771144": 382,
        "0.774461": 383,
        "0.787728": 384,
        "0.792703": 385,
        "0.80597": 386,
        "0.807629": 387,
        "0.829187": 388,
        "0.834163": 389,
        "0.839138": 390,
        "0.844113": 391,
        "0.84743": 392,
        "0.850746": 393,
        "0.854063": 394,
        "0.882255": 395,
        "0.893864": 396,
        "0.895522": 397,
        "0.915423": 398,
        "0.922056": 399,
        "0.930348": 400,
        "0.932007": 401,
        "0.941957": 402,
        "0.943615": 403,
        "0.956882": 404,
        "0.958541": 405,
        "0.971808": 406,
        "0.976783": 407,
        "0.978441": 408,
        "0.986733": 409,
        "0.258706": 410,
        "0.333333": 411,
        "0.339967": 412,
        "0.359867": 413,
        "0.383085": 414,
        "0.416252": 415,
        "0.41791": 416,
        "0.419569": 417,
        "0.424544": 418,
        "0.427861": 419,
        "0.429519": 420,
        "0.45937": 421,
        "0.467662": 422,
        "0.475954": 423,
        "0.480929": 424,
        "0.487562": 425,
        "0.492537": 426,
        "0.510779": 427,
        "0.514096": 428,
        "0.525705": 429,
        "0.535655": 430,
        "0.537313": 431,
        "0.538972": 432,
        "0.54063": 433,
        "0.543947": 434,
        "0.55058": 435,
        "0.560531": 436,
        "0.565506": 437,
        "0.578773": 438,
        "0.58209": 439,
        "0.583748": 440,
        "0.587065": 441,
        "0.588723": 442,
        "0.593698": 443,
        "0.595357": 444,
        "0.608624": 445,
        "0.615257": 446,
        "0.621891": 447,
        "0.625207": 448,
        "0.626866": 449,
        "0.635158": 450,
        "0.643449": 451,
        "0.646766": 452,
        "0.648425": 453,
        "0.665008": 454,
        "0.666667": 455,
        "0.679934": 456,
        "0.68325": 457,
        "0.684909": 458,
        "0.686567": 459,
        "0.689884": 460,
        "0.691542": 461,
        "0.699834": 462,
        "0.706468": 463,
        "0.709784": 464,
        "0.713101": 465,
        "0.71476": 466,
        "0.726368": 467,
        "0.736318": 468,
        "0.741294": 469,
        "0.74461": 470,
        "0.749585": 471,
        "0.751244": 472,
        "0.754561": 473,
        "0.762852": 474,
        "0.767828": 475,
        "0.772803": 476,
        "0.779436": 477,
        "0.782753": 478,
        "0.791045": 479,
        "0.794362": 480,
        "0.797678": 481,
        "0.800995": 482,
        "0.804312": 483,
        "0.812604": 484,
        "0.814262": 485,
        "0.81592": 486,
        "0.822554": 487,
        "0.824212": 488,
        "0.830846": 489,
        "0.832504": 490,
        "0.837479": 491,
        "0.845771": 492,
        "0.849088": 493,
        "0.859038": 494,
        "0.860697": 495,
        "0.862355": 496,
        "0.86733": 497,
        "0.868988": 498,
        "0.870647": 499,
        "0.872305": 500,
        "0.875622": 501,
        "0.87728": 502,
        "0.878939": 503,
        "0.883914": 504,
        "0.885572": 505,
        "0.888889": 506,
        "0.892206": 507,
        "0.897181": 508,
        "0.898839": 509,
        "0.900498": 510,
        "0.902156": 511,
        "0.903814": 512,
        "0.905473": 513,
        "0.907131": 514,
        "0.912106": 515,
        "0.913765": 516,
        "0.917081": 517,
        "0.923715": 518,
        "0.933665": 519,
        "0.935323": 520,
        "0.936982": 521,
        "0.93864": 522,
        "0.945274": 523,
        "0.946932": 524,
        "0.953566": 525,
        "0.963516": 526,
        "0.970149": 527,
        "0.973466": 528,
        "0.975124": 529,
        "0.985075": 530,
        "0.988391": 531,
        "0.99005": 532,
        "0.993367": 533,
        "0.995025": 534,
        "0.996683": 535,
        "__OOV__": 536
    },
    "I3": {
        "__PAD__": 0,
        "0.0": 1,
        "0.01": 2,
        "0.02": 3,
        "0.03": 4,
        "0.04": 5,
        "0.05": 6,
        "0.07": 7,
        "0.06": 8,
        "1.0": 9,
        "0.08": 10,
        "0.09": 11,
        "0.11": 12,
        "0.1": 13,
        "0.12": 14,
        "0.13": 15,
        "0.14": 16,
        "0.15": 17,
        "0.16": 18,
        "0.18": 19,
        "0.17": 20,
        "0.2": 21,
        "0.19": 22,
        "0.21": 23,
        "0.22": 24,
        "0.25": 25,
        "0.23": 26,
        "0.26": 27,
        "0.24": 28,
        "0.27": 29,
        "0.29": 30,
        "0.28": 31,
        "0.3": 32,
        "0.31": 33,
        "0.35": 34,
        "0.32": 35,
        "0.33": 36,
        "0.36": 37,
        "0.34": 38,
        "0.38": 39,
        "0.37": 40,
        "0.46": 41,
        "0.39": 42,
        "0.42": 43,
        "0.43": 44,
        "0.41": 45,
        "0.44": 46,
        "0.4": 47,
        "0.47": 48,
        "0.5": 49,
        "0.52": 50,
        "0.54": 51,
        "0.55": 52,
        "0.49": 53,
        "0.53": 54,
        "0.56": 55,
        "0.48": 56,
        "0.62": 57,
        "0.51": 58,
        "0.45": 59,
        "0.57": 60,
        "0.64": 61,
        "0.66": 62,
        "0.76": 63,
        "0.58": 64,
        "0.63": 65,
        "0.81": 66,
        "0.92": 67,
        "0.59": 68,
        "0.6": 69,
        "0.65": 70,
        "0.71": 71,
        "0.73": 72,
        "0.74": 73,
        "0.78": 74,
        "0.79": 75,
        "0.61": 76,
        "0.72": 77,
        "0.77": 78,
        "0.82": 79,
        "0.95": 80,
        "0.67": 81,
        "0.8": 82,
        "0.94": 83,
        "0.68": 84,
        "0.69": 85,
        "0.91": 86,
        "0.98": 87,
        "0.88": 88,
        "0.99": 89,
        "0.7": 90,
        "0.75": 91,
        "0.83": 92,
        "0.85": 93,
        "0.87": 94,
        "0.86": 95,
        "0.89": 96,
        "0.9": 97,
        "0.97": 98,
        "0.84": 99,
        "0.93": 100,
        "0.96": 101,
        "__OOV__": 102
    },
    "I4": {
        "__PAD__": 0,
        "0.0": 1,
        "0.02": 2,
        "0.04": 3,
        "0.06": 4,
        "0.08": 5,
        "0.1": 6,
        "0.12": 7,
        "0.14": 8,
        "0.16": 9,
        "0.18": 10,
        "0.2": 11,
        "0.22": 12,
        "0.24": 13,
        "0.26": 14,
        "0.28": 15,
        "0.3": 16,
        "0.32": 17,
        "0.36": 18,
        "0.38": 19,
        "0.34": 20,
        "0.42": 21,
        "0.44": 22,
        "0.4": 23,
        "0.46": 24,
        "0.5": 25,
        "0.52": 26,
        "0.48": 27,
        "0.54": 28,
        "0.56": 29,
        "0.6": 30,
        "0.58": 31,
        "0.62": 32,
        "0.64": 33,
        "0.66": 34,
        "0.7": 35,
        "1.0": 36,
        "0.76": 37,
        "0.68": 38,
        "0.72": 39,
        "0.82": 40,
        "0.74": 41,
        "0.8": 42,
        "0.78": 43,
        "0.86": 44,
        "0.92": 45,
        "0.94": 46,
        "0.84": 47,
        "0.88": 48,
        "0.9": 49,
        "0.96": 50,
        "0.98": 51,
        "__OOV__": 52
    },
    "I5": {
        "__PAD__": 0,
        "1.0": 1,
        "0.0": 2,
        "1.6e-05": 3,
        "3.1e-05": 4,
        "6.3e-05": 5,
        "7.8e-05": 6,
        "0.000109": 7,
        "0.000125": 8,
        "0.000156": 9,
        "0.000188": 10,
        "0.000234": 11,
        "0.000172": 12,
        "0.000219": 13,
        "0.000281": 14,
        "0.000266": 15,
        "0.000391": 16,
        "0.000359": 17,
        "0.000328": 18,
        "0.000438": 19,
        "0.000313": 20,
        "0.000484": 21,
        "0.000562": 22,
        "0.000469": 23,
        "0.000516": 24,
        "0.000422": 25,
        "0.000531": 26,
        "0.000375": 27,
        "0.000625": 28,
        "0.000641": 29,
        "0.00075": 30,
        "0.000594": 31,
        "0.000687": 32,
        "0.000844": 33,
        "0.000734": 34,
        "0.000891": 35,
        "0.000922": 36,
        "0.001141": 37,
        "0.000578": 38,
        "0.001234": 39,
        "0.000672": 40,
        "0.000719": 41,
        "0.000875": 42,
        "0.000984": 43,
        "0.001656": 44,
        "0.002312": 45,
        "0.000781": 46,
        "0.000797": 47,
        "0.001203": 48,
        "0.001594": 49,
        "0.001187": 50,
        "0.001922": 51,
        "0.020672": 52,
        "0.001094": 53,
        "0.001687": 54,
        "0.001703": 55,
        "0.000937": 56,
        "0.001031": 57,
        "0.001359": 58,
        "0.001406": 59,
        "0.001516": 60,
        "0.022406": 61,
        "0.000828": 62,
        "0.001": 63,
        "0.001047": 64,
        "0.001125": 65,
        "0.001156": 66,
        "0.001297": 67,
        "0.001344": 68,
        "0.001609": 69,
        "0.020172": 70,
        "0.021906": 71,
        "0.001547": 72,
        "0.001859": 73,
        "0.001875": 74,
        "0.001969": 75,
        "0.002047": 76,
        "0.002078": 77,
        "0.002359": 78,
        "0.002422": 79,
        "0.002609": 80,
        "0.002812": 81,
        "0.01925": 82,
        "0.019875": 83,
        "0.020516": 84,
        "0.020984": 85,
        "0.021812": 86,
        "0.021969": 87,
        "0.022016": 88,
        "0.022203": 89,
        "0.022656": 90,
        "0.022687": 91,
        "0.000953": 92,
        "0.001078": 93,
        "0.001313": 94,
        "0.001484": 95,
        "0.001563": 96,
        "0.001766": 97,
        "0.001797": 98,
        "0.017812": 99,
        "0.020625": 100,
        "0.021094": 101,
        "0.021281": 102,
        "0.021328": 103,
        "0.022047": 104,
        "0.022578": 105,
        "0.023391": 106,
        "0.001453": 107,
        "0.0015": 108,
        "0.001844": 109,
        "0.002": 110,
        "0.002156": 111,
        "0.002875": 112,
        "0.003078": 113,
        "0.003344": 114,
        "0.003906": 115,
        "0.004016": 116,
        "0.017094": 117,
        "0.018016": 118,
        "0.018437": 119,
        "0.02025": 120,
        "0.021172": 121,
        "0.021797": 122,
        "0.021937": 123,
        "0.022172": 124,
        "0.022328": 125,
        "0.023094": 126,
        "0.023141": 127,
        "0.023281": 128,
        "0.023859": 129,
        "0.043984": 130,
        "0.044062": 131,
        "0.044562": 132,
        "0.045031": 133,
        "0.001281": 134,
        "0.001437": 135,
        "0.00175": 136,
        "0.001813": 137,
        "0.001906": 138,
        "0.002016": 139,
        "0.002109": 140,
        "0.002375": 141,
        "0.002406": 142,
        "0.002437": 143,
        "0.002469": 144,
        "0.003187": 145,
        "0.003375": 146,
        "0.003812": 147,
        "0.004328": 148,
        "0.004766": 149,
        "0.005219": 150,
        "0.005594": 151,
        "0.016078": 152,
        "0.016844": 153,
        "0.018797": 154,
        "0.01975": 155,
        "0.020125": 156,
        "0.020359": 157,
        "0.020563": 158,
        "0.020781": 159,
        "0.020875": 160,
        "0.020969": 161,
        "0.021047": 162,
        "0.021484": 163,
        "0.021531": 164,
        "0.022156": 165,
        "0.02225": 166,
        "0.022266": 167,
        "0.022359": 168,
        "0.022531": 169,
        "0.022562": 170,
        "0.022891": 171,
        "0.023125": 172,
        "0.023453": 173,
        "0.023547": 174,
        "0.023625": 175,
        "0.023688": 176,
        "0.024188": 177,
        "0.043109": 178,
        "0.043891": 179,
        "0.044547": 180,
        "0.044594": 181,
        "0.045594": 182,
        "0.066891": 183,
        "0.00125": 184,
        "0.001641": 185,
        "0.002063": 186,
        "0.002203": 187,
        "0.00225": 188,
        "0.002531": 189,
        "0.002641": 190,
        "0.002734": 191,
        "0.002828": 192,
        "0.002969": 193,
        "0.003172": 194,
        "0.003281": 195,
        "0.0035": 196,
        "0.003656": 197,
        "0.004297": 198,
        "0.015828": 199,
        "0.015906": 200,
        "0.016578": 201,
        "0.016875": 202,
        "0.016953": 203,
        "0.017031": 204,
        "0.0175": 205,
        "0.017672": 206,
        "0.018109": 207,
        "0.018672": 208,
        "0.018953": 209,
        "0.019406": 210,
        "0.019453": 211,
        "0.019641": 212,
        "0.020109": 213,
        "0.020156": 214,
        "0.020328": 215,
        "0.020469": 216,
        "0.020688": 217,
        "0.021141": 218,
        "0.021203": 219,
        "0.021641": 220,
        "0.021656": 221,
        "0.021687": 222,
        "0.02175": 223,
        "0.021859": 224,
        "0.021953": 225,
        "0.022": 226,
        "0.022109": 227,
        "0.0225": 228,
        "0.022984": 229,
        "0.023328": 230,
        "0.023344": 231,
        "0.023641": 232,
        "0.023906": 233,
        "0.024156": 234,
        "0.024469": 235,
        "0.025844": 236,
        "0.043531": 237,
        "0.043672": 238,
        "0.043844": 239,
        "0.044344": 240,
        "0.044359": 241,
        "0.044859": 242,
        "0.045": 243,
        "0.045078": 244,
        "0.045172": 245,
        "0.045359": 246,
        "0.045422": 247,
        "0.045531": 248,
        "0.001391": 249,
        "0.001719": 250,
        "0.001953": 251,
        "0.002625": 252,
        "0.002672": 253,
        "0.002922": 254,
        "0.002984": 255,
        "0.003031": 256,
        "0.003203": 257,
        "0.003406": 258,
        "0.003547": 259,
        "0.003641": 260,
        "0.003703": 261,
        "0.003922": 262,
        "0.004047": 263,
        "0.004203": 264,
        "0.004406": 265,
        "0.004469": 266,
        "0.004687": 267,
        "0.005422": 268,
        "0.006266": 269,
        "0.007219": 270,
        "0.008094": 271,
        "0.008953": 272,
        "0.010297": 273,
        "0.011062": 274,
        "0.012547": 275,
        "0.014172": 276,
        "0.015422": 277,
        "0.015656": 278,
        "0.015719": 279,
        "0.016125": 280,
        "0.016828": 281,
        "0.017266": 282,
        "0.017297": 283,
        "0.017703": 284,
        "0.017969": 285,
        "0.018234": 286,
        "0.018391": 287,
        "0.018687": 288,
        "0.018937": 289,
        "0.019187": 290,
        "0.019203": 291,
        "0.019391": 292,
        "0.019766": 293,
        "0.019859": 294,
        "0.020203": 295,
        "0.020406": 296,
        "0.020422": 297,
        "0.020844": 298,
        "0.020938": 299,
        "0.021": 300,
        "0.021125": 301,
        "0.021234": 302,
        "0.02125": 303,
        "0.021375": 304,
        "0.021406": 305,
        "0.021547": 306,
        "0.021703": 307,
        "0.022219": 308,
        "0.022312": 309,
        "0.022469": 310,
        "0.022609": 311,
        "0.022625": 312,
        "0.022672": 313,
        "0.022828": 314,
        "0.022937": 315,
        "0.023047": 316,
        "0.023219": 317,
        "0.023297": 318,
        "0.023375": 319,
        "0.023438": 320,
        "0.023484": 321,
        "0.023531": 322,
        "0.023578": 323,
        "0.023797": 324,
        "0.024047": 325,
        "0.024109": 326,
        "0.025469": 327,
        "0.025859": 328,
        "0.04": 329,
        "0.041734": 330,
        "0.042875": 331,
        "0.042969": 332,
        "0.043219": 333,
        "0.043734": 334,
        "0.044812": 335,
        "0.044953": 336,
        "0.045062": 337,
        "0.045156": 338,
        "0.045234": 339,
        "0.045391": 340,
        "0.045687": 341,
        "0.045844": 342,
        "0.046766": 343,
        "0.047063": 344,
        "0.047641": 345,
        "0.049781": 346,
        "0.066594": 347,
        "0.06725": 348,
        "0.090359": 349,
        "0.110531": 350,
        "0.134297": 351,
        "0.002172": 352,
        "0.002219": 353,
        "0.002328": 354,
        "0.002484": 355,
        "0.002516": 356,
        "0.002563": 357,
        "0.002578": 358,
        "0.002766": 359,
        "0.002781": 360,
        "0.002844": 361,
        "0.002891": 362,
        "0.002938": 363,
        "0.003": 364,
        "0.003328": 365,
        "0.003563": 366,
        "0.003594": 367,
        "0.003891": 368,
        "0.004109": 369,
        "0.0045": 370,
        "0.004516": 371,
        "0.004625": 372,
        "0.004938": 373,
        "0.004984": 374,
        "0.005141": 375,
        "0.005734": 376,
        "0.00575": 377,
        "0.005812": 378,
        "0.006188": 379,
        "0.006875": 380,
        "0.007313": 381,
        "0.007344": 382,
        "0.0075": 383,
        "0.007734": 384,
        "0.00775": 385,
        "0.008203": 386,
        "0.009672": 387,
        "0.011172": 388,
        "0.011281": 389,
        "0.012188": 390,
        "0.012406": 391,
        "0.012656": 392,
        "0.013297": 393,
        "0.013719": 394,
        "0.013766": 395,
        "0.013984": 396,
        "0.014094": 397,
        "0.014531": 398,
        "0.014578": 399,
        "0.014797": 400,
        "0.015609": 401,
        "0.016172": 402,
        "0.016422": 403,
        "0.016531": 404,
        "0.01675": 405,
        "0.016891": 406,
        "0.017": 407,
        "0.017594": 408,
        "0.017828": 409,
        "0.018031": 410,
        "0.018187": 411,
        "0.018219": 412,
        "0.018266": 413,
        "0.018422": 414,
        "0.018469": 415,
        "0.018484": 416,
        "0.018531": 417,
        "0.018625": 418,
        "0.018719": 419,
        "0.018922": 420,
        "0.018984": 421,
        "0.019281": 422,
        "0.019297": 423,
        "0.019344": 424,
        "0.019437": 425,
        "0.019688": 426,
        "0.019797": 427,
        "0.019813": 428,
        "0.02": 429,
        "0.020016": 430,
        "0.020219": 431,
        "0.020438": 432,
        "0.020609": 433,
        "0.020828": 434,
        "0.021031": 435,
        "0.021188": 436,
        "0.021438": 437,
        "0.0215": 438,
        "0.021562": 439,
        "0.021609": 440,
        "0.021766": 441,
        "0.022094": 442,
        "0.022375": 443,
        "0.022422": 444,
        "0.022516": 445,
        "0.022766": 446,
        "0.022781": 447,
        "0.022812": 448,
        "0.023078": 449,
        "0.023422": 450,
        "0.023813": 451,
        "0.023844": 452,
        "0.024016": 453,
        "0.024094": 454,
        "0.024313": 455,
        "0.024359": 456,
        "0.025078": 457,
        "0.025547": 458,
        "0.025703": 459,
        "0.025953": 460,
        "0.026141": 461,
        "0.026187": 462,
        "0.026266": 463,
        "0.026297": 464,
        "0.027516": 465,
        "0.036578": 466,
        "0.038672": 467,
        "0.038922": 468,
        "0.039297": 469,
        "0.039531": 470,
        "0.039563": 471,
        "0.040047": 472,
        "0.040531": 473,
        "0.040609": 474,
        "0.040859": 475,
        "0.041141": 476,
        "0.041531": 477,
        "0.041906": 478,
        "0.041953": 479,
        "0.042938": 480,
        "0.043062": 481,
        "0.043141": 482,
        "0.043469": 483,
        "0.043594": 484,
        "0.043687": 485,
        "0.044109": 486,
        "0.044141": 487,
        "0.044156": 488,
        "0.044187": 489,
        "0.044312": 490,
        "0.044437": 491,
        "0.0445": 492,
        "0.044828": 493,
        "0.04575": 494,
        "0.046078": 495,
        "0.046297": 496,
        "0.046547": 497,
        "0.046641": 498,
        "0.047047": 499,
        "0.047172": 500,
        "0.047328": 501,
        "0.048484": 502,
        "0.049688": 503,
        "0.063437": 504,
        "0.065828": 505,
        "0.066391": 506,
        "0.066641": 507,
        "0.067016": 508,
        "0.067312": 509,
        "0.067422": 510,
        "0.067469": 511,
        "0.068187": 512,
        "0.068297": 513,
        "0.069266": 514,
        "0.08025": 515,
        "0.090313": 516,
        "0.090781": 517,
        "0.093047": 518,
        "0.002687": 519,
        "0.002719": 520,
        "0.00325": 521,
        "0.003297": 522,
        "0.003391": 523,
        "0.003609": 524,
        "0.003734": 525,
        "0.003766": 526,
        "0.003953": 527,
        "0.004": 528,
        "0.004063": 529,
        "0.004094": 530,
        "0.004156": 531,
        "0.004313": 532,
        "0.004359": 533,
        "0.004453": 534,
        "0.004672": 535,
        "0.004828": 536,
        "0.005031": 537,
        "0.005094": 538,
        "0.005188": 539,
        "0.005281": 540,
        "0.005297": 541,
        "0.0055": 542,
        "0.005703": 543,
        "0.005938": 544,
        "0.006047": 545,
        "0.006109": 546,
        "0.006359": 547,
        "0.006609": 548,
        "0.006656": 549,
        "0.007625": 550,
        "0.008156": 551,
        "0.008313": 552,
        "0.008438": 553,
        "0.009266": 554,
        "0.009312": 555,
        "0.009391": 556,
        "0.009531": 557,
        "0.009781": 558,
        "0.009828": 559,
        "0.010438": 560,
        "0.010516": 561,
        "0.010563": 562,
        "0.010859": 563,
        "0.011406": 564,
        "0.011641": 565,
        "0.011766": 566,
        "0.01225": 567,
        "0.0125": 568,
        "0.013219": 569,
        "0.014547": 570,
        "0.014734": 571,
        "0.014891": 572,
        "0.014937": 573,
        "0.015": 574,
        "0.015187": 575,
        "0.015469": 576,
        "0.0155": 577,
        "0.015922": 578,
        "0.016219": 579,
        "0.016344": 580,
        "0.016438": 581,
        "0.016469": 582,
        "0.016484": 583,
        "0.0165": 584,
        "0.016547": 585,
        "0.016906": 586,
        "0.016984": 587,
        "0.017047": 588,
        "0.017109": 589,
        "0.017141": 590,
        "0.017156": 591,
        "0.017406": 592,
        "0.017625": 593,
        "0.01775": 594,
        "0.017906": 595,
        "0.018": 596,
        "0.018125": 597,
        "0.018156": 598,
        "0.018375": 599,
        "0.018781": 600,
        "0.018828": 601,
        "0.018891": 602,
        "0.019": 603,
        "0.019094": 604,
        "0.019125": 605,
        "0.019156": 606,
        "0.019359": 607,
        "0.019484": 608,
        "0.0195": 609,
        "0.019516": 610,
        "0.019563": 611,
        "0.019609": 612,
        "0.019703": 613,
        "0.019719": 614,
        "0.019969": 615,
        "0.020047": 616,
        "0.020375": 617,
        "0.020484": 618,
        "0.020578": 619,
        "0.020719": 620,
        "0.020813": 621,
        "0.020891": 622,
        "0.021344": 623,
        "0.021391": 624,
        "0.021453": 625,
        "0.021734": 626,
        "0.022062": 627,
        "0.022125": 628,
        "0.022297": 629,
        "0.022734": 630,
        "0.022859": 631,
        "0.022922": 632,
        "0.022969": 633,
        "0.023187": 634,
        "0.02325": 635,
        "0.0235": 636,
        "0.023594": 637,
        "0.023781": 638,
        "0.023891": 639,
        "0.023938": 640,
        "0.024": 641,
        "0.024141": 642,
        "0.024219": 643,
        "0.024266": 644,
        "0.024344": 645,
        "0.024375": 646,
        "0.024406": 647,
        "0.024563": 648,
        "0.024578": 649,
        "0.024938": 650,
        "0.025063": 651,
        "0.025141": 652,
        "0.025266": 653,
        "0.025328": 654,
        "0.025578": 655,
        "0.025625": 656,
        "0.026672": 657,
        "0.026719": 658,
        "0.026766": 659,
        "0.026797": 660,
        "0.026812": 661,
        "0.027172": 662,
        "0.027328": 663,
        "0.027531": 664,
        "0.028391": 665,
        "0.028516": 666,
        "0.028547": 667,
        "0.031016": 668,
        "0.031328": 669,
        "0.034797": 670,
        "0.036531": 671,
        "0.036844": 672,
        "0.037234": 673,
        "0.037406": 674,
        "0.037875": 675,
        "0.038969": 676,
        "0.038984": 677,
        "0.039047": 678,
        "0.039125": 679,
        "0.039656": 680,
        "0.039688": 681,
        "0.039703": 682,
        "0.039859": 683,
        "0.039938": 684,
        "0.040375": 685,
        "0.040625": 686,
        "0.040734": 687,
        "0.040766": 688,
        "0.040813": 689,
        "0.041297": 690,
        "0.041328": 691,
        "0.041344": 692,
        "0.041422": 693,
        "0.041781": 694,
        "0.042203": 695,
        "0.042219": 696,
        "0.042375": 697,
        "0.042422": 698,
        "0.042453": 699,
        "0.042828": 700,
        "0.042859": 701,
        "0.043078": 702,
        "0.043234": 703,
        "0.043266": 704,
        "0.043578": 705,
        "0.043703": 706,
        "0.043906": 707,
        "0.044609": 708,
        "0.044703": 709,
        "0.04475": 710,
        "0.044766": 711,
        "0.044875": 712,
        "0.045125": 713,
        "0.045187": 714,
        "0.045312": 715,
        "0.045328": 716,
        "0.045375": 717,
        "0.045719": 718,
        "0.045797": 719,
        "0.045891": 720,
        "0.046047": 721,
        "0.046187": 722,
        "0.046203": 723,
        "0.046312": 724,
        "0.046484": 725,
        "0.046609": 726,
        "0.046797": 727,
        "0.046906": 728,
        "0.046922": 729,
        "0.046969": 730,
        "0.047313": 731,
        "0.047719": 732,
        "0.047813": 733,
        "0.048": 734,
        "0.048078": 735,
        "0.048703": 736,
        "0.050141": 737,
        "0.052078": 738,
        "0.052328": 739,
        "0.063469": 740,
        "0.063625": 741,
        "0.065156": 742,
        "0.06525": 743,
        "0.065281": 744,
        "0.065406": 745,
        "0.065781": 746,
        "0.066031": 747,
        "0.066172": 748,
        "0.06625": 749,
        "0.066328": 750,
        "0.066531": 751,
        "0.066687": 752,
        "0.066703": 753,
        "0.066859": 754,
        "0.067328": 755,
        "0.067359": 756,
        "0.067625": 757,
        "0.067828": 758,
        "0.069906": 759,
        "0.070141": 760,
        "0.070281": 761,
        "0.08475": 762,
        "0.085469": 763,
        "0.086594": 764,
        "0.088641": 765,
        "0.088953": 766,
        "0.089109": 767,
        "0.089922": 768,
        "0.090891": 769,
        "0.092719": 770,
        "0.098672": 771,
        "0.107719": 772,
        "0.109797": 773,
        "0.110609": 774,
        "0.112625": 775,
        "0.113859": 776,
        "0.132203": 777,
        "0.156688": 778,
        "0.180844": 779,
        "0.225156": 780,
        "0.631297": 781,
        "0.002125": 782,
        "0.003047": 783,
        "0.003125": 784,
        "0.003141": 785,
        "0.003234": 786,
        "0.003438": 787,
        "0.003453": 788,
        "0.003484": 789,
        "0.003531": 790,
        "0.00375": 791,
        "0.003844": 792,
        "0.004125": 793,
        "0.004172": 794,
        "0.004219": 795,
        "0.004266": 796,
        "0.004531": 797,
        "0.004562": 798,
        "0.004578": 799,
        "0.004656": 800,
        "0.004734": 801,
        "0.004859": 802,
        "0.004922": 803,
        "0.005063": 804,
        "0.005078": 805,
        "0.005125": 806,
        "0.005234": 807,
        "0.00525": 808,
        "0.005375": 809,
        "0.005437": 810,
        "0.005453": 811,
        "0.005484": 812,
        "0.005891": 813,
        "0.005906": 814,
        "0.005984": 815,
        "0.006063": 816,
        "0.006156": 817,
        "0.006344": 818,
        "0.006469": 819,
        "0.006625": 820,
        "0.006859": 821,
        "0.007031": 822,
        "0.007109": 823,
        "0.007188": 824,
        "0.007391": 825,
        "0.007422": 826,
        "0.007469": 827,
        "0.007531": 828,
        "0.007547": 829,
        "0.007578": 830,
        "0.007844": 831,
        "0.008": 832,
        "0.008188": 833,
        "0.008391": 834,
        "0.008563": 835,
        "0.008609": 836,
        "0.00875": 837,
        "0.008812": 838,
        "0.008859": 839,
        "0.009031": 840,
        "0.009125": 841,
        "0.009234": 842,
        "0.01": 843,
        "0.010234": 844,
        "0.010281": 845,
        "0.010484": 846,
        "0.0105": 847,
        "0.010594": 848,
        "0.010609": 849,
        "0.010719": 850,
        "0.010812": 851,
        "0.010875": 852,
        "0.010953": 853,
        "0.011047": 854,
        "0.011203": 855,
        "0.011516": 856,
        "0.011562": 857,
        "0.011719": 858,
        "0.011781": 859,
        "0.011875": 860,
        "0.012203": 861,
        "0.012344": 862,
        "0.012453": 863,
        "0.012484": 864,
        "0.012641": 865,
        "0.012703": 866,
        "0.012797": 867,
        "0.012906": 868,
        "0.013016": 869,
        "0.013359": 870,
        "0.0135": 871,
        "0.013562": 872,
        "0.013609": 873,
        "0.013734": 874,
        "0.013813": 875,
        "0.013859": 876,
        "0.014016": 877,
        "0.014031": 878,
        "0.014125": 879,
        "0.014141": 880,
        "0.014297": 881,
        "0.014328": 882,
        "0.014375": 883,
        "0.014422": 884,
        "0.014453": 885,
        "0.014484": 886,
        "0.014625": 887,
        "0.014656": 888,
        "0.01475": 889,
        "0.014812": 890,
        "0.014844": 891,
        "0.014906": 892,
        "0.014953": 893,
        "0.015219": 894,
        "0.015266": 895,
        "0.015562": 896,
        "0.015781": 897,
        "0.015813": 898,
        "0.016109": 899,
        "0.016141": 900,
        "0.016234": 901,
        "0.016328": 902,
        "0.016391": 903,
        "0.016938": 904,
        "0.017063": 905,
        "0.017203": 906,
        "0.017234": 907,
        "0.01725": 908,
        "0.017391": 909,
        "0.017656": 910,
        "0.017859": 911,
        "0.017922": 912,
        "0.017953": 913,
        "0.018312": 914,
        "0.018562": 915,
        "0.018641": 916,
        "0.018844": 917,
        "0.019047": 918,
        "0.019078": 919,
        "0.019141": 920,
        "0.019312": 921,
        "0.019547": 922,
        "0.019656": 923,
        "0.019906": 924,
        "0.020313": 925,
        "0.020641": 926,
        "0.020766": 927,
        "0.020922": 928,
        "0.021297": 929,
        "0.021594": 930,
        "0.021844": 931,
        "0.021891": 932,
        "0.022453": 933,
        "0.022719": 934,
        "0.022875": 935,
        "0.023016": 936,
        "0.023031": 937,
        "0.023172": 938,
        "0.023656": 939,
        "0.023953": 940,
        "0.023984": 941,
        "0.02425": 942,
        "0.024297": 943,
        "0.024422": 944,
        "0.024453": 945,
        "0.0245": 946,
        "0.024672": 947,
        "0.02475": 948,
        "0.024766": 949,
        "0.024781": 950,
        "0.024813": 951,
        "0.024922": 952,
        "0.025031": 953,
        "0.025109": 954,
        "0.025188": 955,
        "0.025219": 956,
        "0.025422": 957,
        "0.025437": 958,
        "0.025531": 959,
        "0.025641": 960,
        "0.025734": 961,
        "0.025797": 962,
        "0.025891": 963,
        "0.025906": 964,
        "0.026": 965,
        "0.026031": 966,
        "0.026094": 967,
        "0.026234": 968,
        "0.02625": 969,
        "0.026391": 970,
        "0.026469": 971,
        "0.026625": 972,
        "0.026703": 973,
        "0.026859": 974,
        "0.026906": 975,
        "0.027016": 976,
        "0.027062": 977,
        "0.027125": 978,
        "0.027156": 979,
        "0.027359": 980,
        "0.027469": 981,
        "0.027563": 982,
        "0.027672": 983,
        "0.028156": 984,
        "0.028406": 985,
        "0.028563": 986,
        "0.028969": 987,
        "0.029578": 988,
        "0.029641": 989,
        "0.030141": 990,
        "0.030656": 991,
        "0.030797": 992,
        "0.031406": 993,
        "0.031813": 994,
        "0.031969": 995,
        "0.032031": 996,
        "0.033047": 997,
        "0.033547": 998,
        "0.033625": 999,
        "0.034328": 1000,
        "0.035": 1001,
        "0.035141": 1002,
        "0.035297": 1003,
        "0.035703": 1004,
        "0.035859": 1005,
        "0.036437": 1006,
        "0.036719": 1007,
        "0.036891": 1008,
        "0.037156": 1009,
        "0.037187": 1010,
        "0.03725": 1011,
        "0.037562": 1012,
        "0.037656": 1013,
        "0.03775": 1014,
        "0.037812": 1015,
        "0.037906": 1016,
        "0.037922": 1017,
        "0.037953": 1018,
        "0.038375": 1019,
        "0.038469": 1020,
        "0.038562": 1021,
        "0.038641": 1022,
        "0.038875": 1023,
        "0.039406": 1024,
        "0.0395": 1025,
        "0.039547": 1026,
        "0.039594": 1027,
        "0.039734": 1028,
        "0.039797": 1029,
        "0.039844": 1030,
        "0.039953": 1031,
        "0.040016": 1032,
        "0.040172": 1033,
        "0.040266": 1034,
        "0.040313": 1035,
        "0.040688": 1036,
        "0.040828": 1037,
        "0.040891": 1038,
        "0.040938": 1039,
        "0.040984": 1040,
        "0.041031": 1041,
        "0.041219": 1042,
        "0.041234": 1043,
        "0.041375": 1044,
        "0.041484": 1045,
        "0.041594": 1046,
        "0.041656": 1047,
        "0.041797": 1048,
        "0.041984": 1049,
        "0.042047": 1050,
        "0.042094": 1051,
        "0.042141": 1052,
        "0.042297": 1053,
        "0.042344": 1054,
        "0.042516": 1055,
        "0.042547": 1056,
        "0.042563": 1057,
        "0.042578": 1058,
        "0.042609": 1059,
        "0.042656": 1060,
        "0.043016": 1061,
        "0.043187": 1062,
        "0.043312": 1063,
        "0.043375": 1064,
        "0.043391": 1065,
        "0.0435": 1066,
        "0.043625": 1067,
        "0.043641": 1068,
        "0.044203": 1069,
        "0.044297": 1070,
        "0.044453": 1071,
        "0.044469": 1072,
        "0.044656": 1073,
        "0.044672": 1074,
        "0.044719": 1075,
        "0.044922": 1076,
        "0.045016": 1077,
        "0.045109": 1078,
        "0.045219": 1079,
        "0.045266": 1080,
        "0.045281": 1081,
        "0.045437": 1082,
        "0.045484": 1083,
        "0.045516": 1084,
        "0.045578": 1085,
        "0.045672": 1086,
        "0.045953": 1087,
        "0.046094": 1088,
        "0.046359": 1089,
        "0.046516": 1090,
        "0.046594": 1091,
        "0.046719": 1092,
        "0.047016": 1093,
        "0.047078": 1094,
        "0.047156": 1095,
        "0.047375": 1096,
        "0.047406": 1097,
        "0.047516": 1098,
        "0.047578": 1099,
        "0.047766": 1100,
        "0.048594": 1101,
        "0.048906": 1102,
        "0.048922": 1103,
        "0.049016": 1104,
        "0.049125": 1105,
        "0.049156": 1106,
        "0.049172": 1107,
        "0.049266": 1108,
        "0.049297": 1109,
        "0.049609": 1110,
        "0.049734": 1111,
        "0.050594": 1112,
        "0.05075": 1113,
        "0.050812": 1114,
        "0.051156": 1115,
        "0.051516": 1116,
        "0.051578": 1117,
        "0.052234": 1118,
        "0.053547": 1119,
        "0.054391": 1120,
        "0.056078": 1121,
        "0.0575": 1122,
        "0.059797": 1123,
        "0.060141": 1124,
        "0.060875": 1125,
        "0.061219": 1126,
        "0.061375": 1127,
        "0.061844": 1128,
        "0.062344": 1129,
        "0.062359": 1130,
        "0.062469": 1131,
        "0.062516": 1132,
        "0.062812": 1133,
        "0.062984": 1134,
        "0.063266": 1135,
        "0.063375": 1136,
        "0.063531": 1137,
        "0.063719": 1138,
        "0.063734": 1139,
        "0.06375": 1140,
        "0.063922": 1141,
        "0.064281": 1142,
        "0.064391": 1143,
        "0.064453": 1144,
        "0.064641": 1145,
        "0.064859": 1146,
        "0.064969": 1147,
        "0.065172": 1148,
        "0.065312": 1149,
        "0.065328": 1150,
        "0.065437": 1151,
        "0.065766": 1152,
        "0.066141": 1153,
        "0.066453": 1154,
        "0.066547": 1155,
        "0.066797": 1156,
        "0.067": 1157,
        "0.067094": 1158,
        "0.067109": 1159,
        "0.067203": 1160,
        "0.067453": 1161,
        "0.067531": 1162,
        "0.067578": 1163,
        "0.067656": 1164,
        "0.067766": 1165,
        "0.067812": 1166,
        "0.067891": 1167,
        "0.067937": 1168,
        "0.068016": 1169,
        "0.068172": 1170,
        "0.06825": 1171,
        "0.068391": 1172,
        "0.068531": 1173,
        "0.06875": 1174,
        "0.069016": 1175,
        "0.069453": 1176,
        "0.069656": 1177,
        "0.06975": 1178,
        "0.069812": 1179,
        "0.070312": 1180,
        "0.070391": 1181,
        "0.070484": 1182,
        "0.0705": 1183,
        "0.071063": 1184,
        "0.071406": 1185,
        "0.072125": 1186,
        "0.072438": 1187,
        "0.072781": 1188,
        "0.083687": 1189,
        "0.083984": 1190,
        "0.085516": 1191,
        "0.086016": 1192,
        "0.086063": 1193,
        "0.086141": 1194,
        "0.086234": 1195,
        "0.086422": 1196,
        "0.0865": 1197,
        "0.087141": 1198,
        "0.087344": 1199,
        "0.087422": 1200,
        "0.0875": 1201,
        "0.087969": 1202,
        "0.088016": 1203,
        "0.088063": 1204,
        "0.088188": 1205,
        "0.088422": 1206,
        "0.088469": 1207,
        "0.088828": 1208,
        "0.088891": 1209,
        "0.089156": 1210,
        "0.089469": 1211,
        "0.0895": 1212,
        "0.089516": 1213,
        "0.089609": 1214,
        "0.089703": 1215,
        "0.089766": 1216,
        "0.089797": 1217,
        "0.089813": 1218,
        "0.089875": 1219,
        "0.09": 1220,
        "0.090063": 1221,
        "0.090531": 1222,
        "0.090922": 1223,
        "0.091031": 1224,
        "0.091156": 1225,
        "0.091313": 1226,
        "0.09175": 1227,
        "0.092016": 1228,
        "0.092078": 1229,
        "0.097797": 1230,
        "0.098406": 1231,
        "0.105625": 1232,
        "0.105969": 1233,
        "0.107266": 1234,
        "0.108391": 1235,
        "0.108641": 1236,
        "0.109437": 1237,
        "0.10975": 1238,
        "0.110266": 1239,
        "0.110406": 1240,
        "0.110516": 1241,
        "0.110719": 1242,
        "0.111375": 1243,
        "0.111859": 1244,
        "0.111906": 1245,
        "0.112": 1246,
        "0.112266": 1247,
        "0.1125": 1248,
        "0.113125": 1249,
        "0.116406": 1250,
        "0.118047": 1251,
        "0.120641": 1252,
        "0.132672": 1253,
        "0.134": 1254,
        "0.134406": 1255,
        "0.134563": 1256,
        "0.136437": 1257,
        "0.136859": 1258,
        "0.138547": 1259,
        "0.141344": 1260,
        "0.143437": 1261,
        "0.153844": 1262,
        "0.155688": 1263,
        "0.155828": 1264,
        "0.156031": 1265,
        "0.156297": 1266,
        "0.156641": 1267,
        "0.156734": 1268,
        "0.157156": 1269,
        "0.157562": 1270,
        "0.157859": 1271,
        "0.158438": 1272,
        "0.160875": 1273,
        "0.168937": 1274,
        "0.179391": 1275,
        "0.180984": 1276,
        "0.232281": 1277,
        "0.289563": 1278,
        "0.292047": 1279,
        "0.294656": 1280,
        "0.339875": 1281,
        "0.383484": 1282,
        "0.385172": 1283,
        "0.470234": 1284,
        "0.495031": 1285,
        "0.495516": 1286,
        "0.534594": 1287,
        "0.562672": 1288,
        "0.583828": 1289,
        "0.649687": 1290,
        "0.675937": 1291,
        "0.697375": 1292,
        "0.002266": 1293,
        "0.003094": 1294,
        "0.003797": 1295,
        "0.003859": 1296,
        "0.003969": 1297,
        "0.00425": 1298,
        "0.004375": 1299,
        "0.004781": 1300,
        "0.004812": 1301,
        "0.004891": 1302,
        "0.004969": 1303,
        "0.005172": 1304,
        "0.005328": 1305,
        "0.005344": 1306,
        "0.005391": 1307,
        "0.005547": 1308,
        "0.005625": 1309,
        "0.005641": 1310,
        "0.005844": 1311,
        "0.005953": 1312,
        "0.006016": 1313,
        "0.006094": 1314,
        "0.006203": 1315,
        "0.00625": 1316,
        "0.006375": 1317,
        "0.006406": 1318,
        "0.006422": 1319,
        "0.006453": 1320,
        "0.0065": 1321,
        "0.006516": 1322,
