{
    "time_stamp": {
        "__PAD__": 0,
        "2017/5/6 0:00": 1,
        "2017-05-06 00:00:02": 2,
        "2017-05-06 00:00:01": 3,
        "2017-05-06 00:00:00": 4,
        "__OOV__": 5
    },
    "userid": {
        "__PAD__": 0,
        "227368": 1,
        "874257": 2,
        "514836": 3,
        "911194": 4,
        "693616": 5,
        "477708": 6,
        "479339": 7,
        "268502": 8,
        "616268": 9,
        "832981": 10,
        "992364": 11,
        "370363": 12,
        "524548": 13,
        "549940": 14,
        "664542": 15,
        "754948": 16,
        "871665": 17,
        "353405": 18,
        "55033": 19,
        "1115242": 20,
        "608569": 21,
        "391781": 22,
        "626053": 23,
        "949173": 24,
        "__OOV__": 25
    },
    "adgroup_id": {
        "__PAD__": 0,
        "756739": 1,
        "170301": 2,
        "573514": 3,
        "680144": 4,
        "164095": 5,
        "168937": 6,
        "172298": 7,
        "214782": 8,
        "225892": 9,
        "261620": 10,
        "263526": 11,
        "318447": 12,
        "339931": 13,
        "362454": 14,
        "366559": 15,
        "395732": 16,
        "41803": 17,
        "444691": 18,
        "472153": 19,
        "512277": 20,
        "513129": 21,
        "519384": 22,
        "545057": 23,
        "553889": 24,
        "561543": 25,
        "571696": 26,
        "572396": 27,
        "594936": 28,
        "596489": 29,
        "605570": 30,
        "633154": 31,
        "636019": 32,
        "651184": 33,
        "654663": 34,
        "662621": 35,
        "663034": 36,
        "674268": 37,
        "677904": 38,
        "681978": 39,
        "690119": 40,
        "702219": 41,
        "703594": 42,
        "726574": 43,
        "734869": 44,
        "742211": 45,
        "758902": 46,
        "117738": 47,
        "118678": 48,
        "148505": 49,
        "169140": 50,
        "192645": 51,
        "194654": 52,
        "223448": 53,
        "27032": 54,
        "320222": 55,
        "323703": 56,
        "382468": 57,
        "383937": 58,
        "415119": 59,
        "431258": 60,
        "442618": 61,
        "452391": 62,
        "454239": 63,
        "467092": 64,
        "473741": 65,
        "477950": 66,
        "506323": 67,
        "530249": 68,
        "530563": 69,
        "537137": 70,
        "540137": 71,
        "541502": 72,
        "54756": 73,
        "570475": 74,
        "570906": 75,
        "576624": 76,
        "595104": 77,
        "601638": 78,
        "627549": 79,
        "646876": 80,
        "659142": 81,
        "670415": 82,
        "675017": 83,
        "679190": 84,
        "687140": 85,
        "696459": 86,
        "698324": 87,
        "789390": 88,
        "87979": 89,
        "139850": 90,
        "158525": 91,
        "361919": 92,
        "588074": 93,
        "604453": 94,
        "620312": 95,
        "636508": 96,
        "713414": 97,
        "722867": 98,
        "744970": 99,
        "__OOV__": 100
    },
    "pid": {
        "__PAD__": 0,
        "430548_1007": 1,
        "430539_1007": 2,
        "__OOV__": 3
    },
    "cate_id": {
        "__PAD__": 0,
        "6261": 1,
        "4505": 2,
        "4385": 3,
        "4281": 4,
        "1665": 5,
        "4520": 6,
        "4292": 7,
        "5443": 8,
        "5851": 9,
        "6407": 10,
        "824": 11,
        "4283": 12,
        "6255": 13,
        "8112": 14,
        "4267": 15,
        "6286": 16,
        "7212": 17,
        "1535": 18,
        "4609": 19,
        "1226": 20,
        "4280": 21,
        "4282": 22,
        "4288": 23,
        "5316": 24,
        "6140": 25,
        "6183": 26,
        "6251": 27,
        "6416": 28,
        "6426": 29,
        "6733": 30,
        "6760": 31,
        "7184": 32,
        "9784": 33,
        "10876": 34,
        "2201": 35,
        "333": 36,
        "4278": 37,
        "4284": 38,
        "4532": 39,
        "5263": 40,
        "5487": 41,
        "6158": 42,
        "6433": 43,
        "8202": 44,
        "9460": 45,
        "6432": 46,
        "7339": 47,
        "__OOV__": 48
    },
    "campaign_id": {
        "__PAD__": 0,
        "137739": 1,
        "225404": 2,
        "142840": 3,
        "101437": 4,
        "102833": 5,
        "107755": 6,
        "112846": 7,
        "113420": 8,
        "119792": 9,
        "122722": 10,
        "143482": 11,
        "144634": 12,
        "150068": 13,
        "156256": 14,
        "158024": 15,
        "160194": 16,
        "166931": 17,
        "175802": 18,
        "181057": 19,
        "183759": 20,
        "184743": 21,
        "187111": 22,
        "188896": 23,
        "200410": 24,
        "223853": 25,
        "230502": 26,
        "256512": 27,
        "264355": 28,
        "265350": 29,
        "274193": 30,
        "286110": 31,
        "292338": 32,
        "302529": 33,
        "330322": 34,
        "345717": 35,
        "346951": 36,
        "360936": 37,
        "363218": 38,
        "369584": 39,
        "384547": 40,
        "385451": 41,
        "38772": 42,
        "397994": 43,
        "399132": 44,
        "421861": 45,
        "76341": 46,
        "87006": 47,
        "93454": 48,
        "115316": 49,
        "133152": 50,
        "133243": 51,
        "138066": 52,
        "138651": 53,
        "14905": 54,
        "153671": 55,
        "155404": 56,
        "155775": 57,
        "17377": 58,
        "202498": 59,
        "225230": 60,
        "234927": 61,
        "237347": 62,
        "237467": 63,
        "241951": 64,
        "244703": 65,
        "246731": 66,
        "252478": 67,
        "259290": 68,
        "345337": 69,
        "347880": 70,
        "348684": 71,
        "349173": 72,
        "35662": 73,
        "366810": 74,
        "381129": 75,
        "393232": 76,
        "394213": 77,
        "398109": 78,
        "398575": 79,
        "408795": 80,
        "419685": 81,
        "419872": 82,
        "44486": 83,
        "57459": 84,
        "59075": 85,
        "6710": 86,
        "67660": 87,
        "84597": 88,
        "8530": 89,
        "95200": 90,
        "192463": 91,
        "239633": 92,
        "254792": 93,
        "364151": 94,
        "386201": 95,
        "76510": 96,
        "94871": 97,
        "__OOV__": 98
    },
    "customer": {
        "__PAD__": 0,
        "1210": 1,
        "215611": 2,
        "179648": 3,
        "79797": 4,
        "109572": 5,
        "117313": 6,
        "120884": 7,
        "124874": 8,
        "132719": 9,
        "13787": 10,
        "151804": 11,
        "155607": 12,
        "156608": 13,
        "162663": 14,
        "171746": 15,
        "171879": 16,
        "183715": 17,
        "185150": 18,
        "189572": 19,
        "195682": 20,
        "205433": 21,
        "214436": 22,
        "21689": 23,
        "222509": 24,
        "228674": 25,
        "232575": 26,
        "239574": 27,
        "252276": 28,
        "25471": 29,
        "25728": 30,
        "25760": 31,
        "35990": 32,
        "36888": 33,
        "37031": 34,
        "47076": 35,
        "49079": 36,
        "52598": 37,
        "53778": 38,
        "5406": 39,
        "55297": 40,
        "573": 41,
        "5902": 42,
        "75881": 43,
        "7844": 44,
        "80092": 45,
        "864": 46,
        "88742": 47,
        "96798": 48,
        "103078": 49,
        "11968": 50,
        "119724": 51,
        "13072": 52,
        "131908": 53,
        "135248": 54,
        "144223": 55,
        "14471": 56,
        "149747": 57,
        "155582": 58,
        "157846": 59,
        "172777": 60,
        "173817": 61,
        "179212": 62,
        "1823": 63,
        "184541": 64,
        "186875": 65,
        "20604": 66,
        "217182": 67,
        "223269": 68,
        "22878": 69,
        "238466": 70,
        "24984": 71,
        "254969": 72,
        "28339": 73,
        "32537": 74,
        "33287": 75,
        "343": 76,
        "42812": 77,
        "43184": 78,
        "51721": 79,
        "55729": 80,
        "56774": 81,
        "57362": 82,
        "63559": 83,
        "68631": 84,
        "73832": 85,
        "75534": 86,
        "77114": 87,
        "82710": 88,
        "83172": 89,
        "94205": 90,
        "164284": 91,
        "182659": 92,
        "19216": 93,
        "224983": 94,
        "27731": 95,
        "3024": 96,
        "__OOV__": 97
    },
    "brand": {
        "__PAD__": 0,
        "144123.0": 1,
        "158849.0": 2,
        "337365.0": 3,
        "59477.0": 4,
        "90316.0": 5,
        "197848.0": 6,
        "87032.0": 7,
        "106641.0": 8,
        "106924.0": 9,
        "137274.0": 10,
        "166416.0": 11,
        "194203.0": 12,
        "220468.0": 13,
        "247789.0": 14,
        "255820.0": 15,
        "290511.0": 16,
        "291723.0": 17,
        "293023.0": 18,
        "302582.0": 19,
        "317982.0": 20,
        "327032.0": 21,
        "339907.0": 22,
        "364212.0": 23,
        "388290.0": 24,
        "41873.0": 25,
        "420137.0": 26,
        "424150.0": 27,
        "42518.0": 28,
        "425293.0": 29,
        "42695.0": 30,
        "54471.0": 31,
        "58727.0": 32,
        "73218.0": 33,
        "80633.0": 34,
        "89842.0": 35,
        "98630.0": 36,
        "11022.0": 37,
        "139647.0": 38,
        "141341.0": 39,
        "156936.0": 40,
        "160253.0": 41,
        "166878.0": 42,
        "180856.0": 43,
        "186516.0": 44,
        "194532.0": 45,
        "206353.0": 46,
        "215442.0": 47,
        "234028.0": 48,
        "259883.0": 49,
        "270537.0": 50,
        "304332.0": 51,
        "30520.0": 52,
        "3130.0": 53,
        "314219.0": 54,
        "321464.0": 55,
        "395808.0": 56,
        "40827.0": 57,
        "409777.0": 58,
        "418677.0": 59,
        "455009.0": 60,
        "53923.0": 61,
        "65658.0": 62,
        "95340.0": 63,
        "314496.0": 64,
        "389298.0": 65,
        "__OOV__": 66
    },
    "price": {
        "__PAD__": 0,
        "128.0": 1,
        "299.0": 2,
        "99.0": 3,
        "138.0": 4,
        "168.0": 5,
        "258.0": 6,
        "3.9": 7,
        "358.0": 8,
        "78.0": 9,
        "89.0": 10,
        "159.0": 11,
        "174.0": 12,
        "39.0": 13,
        "79.0": 14,
        "118.0": 15,
        "199.0": 16,
        "68.8": 17,
        "12.5": 18,
        "139.0": 19,
        "149.0": 20,
        "150.0": 21,
        "168.8": 22,
        "18.0": 23,
        "180.0": 24,
        "189.0": 25,
        "19.6": 26,
        "19.8": 27,
        "264.0": 28,
        "28.66": 29,
        "29.8": 30,
        "362.0": 31,
        "43.8": 32,
        "45.0": 33,
        "596.0": 34,
        "69.0": 35,
        "709.0": 36,
        "768.0": 37,
        "88.0": 38,
        "97.5": 39,
        "98.0": 40,
        "109.0": 41,
        "12.4": 42,
        "122.0": 43,
        "129.0": 44,
        "136.0": 45,
        "158.0": 46,
        "163.0": 47,
        "186.0": 48,
        "188.0": 49,
        "190.0": 50,
        "228.0": 51,
        "229.0": 52,
        "269.0": 53,
        "2799.01": 54,
        "28.0": 55,
        "289.0": 56,
        "328.0": 57,
        "359.0": 58,
        "425.0": 59,
        "4360.0": 60,
        "46.0": 61,
        "47.0": 62,
        "48.0": 63,
        "498.0": 64,
        "5.2": 65,
        "6.0": 66,
        "688.0": 67,
        "8.0": 68,
        "8.8": 69,
        "85.0": 70,
        "858.0": 71,
        "899.0": 72,
        "120.0": 73,
        "527.0": 74,
        "59.0": 75,
        "87.0": 76,
        "__OOV__": 77
    },
    "cms_segid": {
        "__PAD__": 0,
        "0.0": 1,
        "33.0": 2,
        "20.0": 3,
        "44.0": 4,
        "16.0": 5,
        "57.0": 6,
        "36.0": 7,
        "8.0": 8,
        "77.0": 9,
        "__OOV__": 10
    },
    "cms_group_id": {
        "__PAD__": 0,
        "3.0": 1,
        "4.0": 2,
        "1.0": 3,
        "5.0": 4,
        "7.0": 5,
        "9.0": 6,
        "2.0": 7,
        "8.0": 8,
        "10.0": 9,
        "__OOV__": 10
    },
    "final_gender_code": {
        "__PAD__": 0,
        "2.0": 1,
        "1.0": 2,
        "__OOV__": 3
    },
    "age_level": {
        "__PAD__": 0,
        "3.0": 1,
        "4.0": 2,
        "1.0": 3,
        "5.0": 4,
        "2.0": 5,
        "__OOV__": 6
    },
    "pvalue_level": {
        "__PAD__": 0,
        "2.0": 1,
        "1.0": 2,
        "__OOV__": 3
    },
    "shopping_level": {
        "__PAD__": 0,
        "3.0": 1,
        "1.0": 2,
        "2.0": 3,
        "__OOV__": 4
    },
    "occupation": {
        "__PAD__": 0,
        "0.0": 1,
        "1.0": 2,
        "__OOV__": 3
    },
    "new_user_class_level": {
        "__PAD__": 0,
        "__OOV__": 1
    },
    "click_sequence": {
        "__PAD__": 0,
        "680144": 1,
        "170301^573514": 2,
        "170301": 3,
        "756739": 4,
        "170301^573514^158525^633154^383937^431258": 5,
        "170301^573514^54756": 6,
        "680144^573514": 7,
        "__OOV__": 8
    }
}